app/controllers/coupons_controller.rb

SELECT "coupons".* FROM "coupons"
---
  def index
    @coupons = Coupon.all

INSERT INTO "coupons" ("code", "discount_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", "CODERSCHOOL"], ["discount_rate", 50], ["created_at", "2015-12-03 08:39:55.415747"], ["updated_at", "2015-12-03 08:39:55.415747"]]
---
  def create
    @coupon = Coupon.new(coupon_params)

    respond_to do |format|
      if @coupon.save

SELECT  "coupons".* FROM "coupons" WHERE "coupons"."id" = $1 LIMIT 1  [["id", 980190963]]
---
    def set_coupon
      @coupon = Coupon.find(params[:id])