app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def show
    page = params[:page].present? ? params[:page] : 1
    @reviews = Review.find_by_dish(params[:id]).page page
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."dish_id" = $1 LIMIT 7 OFFSET 0  [["dish_id", 113629430]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."dish_id" = $1  [["dish_id", 113629430]]

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO "dishes" ("name", "price", "description", "image_url", "menu_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @dish.update(dish_params)
---
UPDATE "dishes" SET "menu_id" = $1, "updated_at" = $2 WHERE "dishes"."id" = $3  [["menu_id", 980190963], ["updated_at", "2015-12-06 10:43:34.665421"], ["id", 980190962]]

    def set_dish
      @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 980190962]]