app/controllers/menus_controller.rb

  def index
    @menus = Menu.all
    current_menu_id = params[:id]
    if (current_menu_id.present?)
      @current_menu = Menu.find(params[:id])
    else
      @current_menu = @menus.first
    end
    @dishes = Dish.find_by_menu(@current_menu.id).page params[:page]
---
SELECT  "menus".* FROM "menus"  ORDER BY "menus"."id" ASC LIMIT 1
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."menu_id" = $1  ORDER BY "dishes"."id" ASC LIMIT 1 OFFSET 0  [["menu_id", 980190963]]
SELECT COUNT(*) FROM "dishes" WHERE "dishes"."menu_id" = $1  [["menu_id", 980190963]]

  def show
    @menus = Menu.all
    @dishes = Dish.find_by_menu(params[:id]).page params[:page]
    @current_menu = Menu.find(params[:id])
    current_dish_id = params[:dish]
    if (current_dish_id.present?)
      @current_dish = Dish.find(current_dish_id)
---
SELECT "menus".* FROM "menus"
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."menu_id" = $1  ORDER BY "dishes"."id" ASC LIMIT 1 OFFSET 0  [["menu_id", 980190964]]
SELECT COUNT(*) FROM "dishes" WHERE "dishes"."menu_id" = $1  [["menu_id", 980190963]]
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save
---
INSERT INTO "menus" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Breakfast"], ["created_at", "2015-12-02 16:14:33.920133"], ["updated_at", "2015-12-02 16:14:33.920133"]]

  def destroy
    @menu.destroy
---
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 5]]

    def set_menu
      @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 5]]