app/controllers/orders_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "coupons".* FROM "coupons" WHERE "coupons"."code" = $1  ORDER BY "coupons"."id" ASC LIMIT 1  [["code", "CODERSCHOOL"]]
INSERT INTO "orders" ("name", "phone", "address", "dish_id", "discount_rate", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    @dish = Dish.find(@order.dish_id)
    @coupon = Coupon.find_by_code(@order.coupon_code)
    discount_rate = @coupon.present? ? @coupon.discount_rate : 0;
    @order.discount_rate = discount_rate
    @order.total_price = @dish.price - @dish.price * discount_rate / 100

    respond_to do |format|
      if @order.save