app/controllers/reviews_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 113629430]]
INSERT INTO "reviews" ("name", "body", "star", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "hoangnn"], ["body", "Deliceous"], ["star", 4], ["dish_id", 113629430], ["created_at", "2015-12-07 13:01:07.949111"], ["updated_at", "2015-12-07 13:01:07.949111"]]
---
  def create
    @dish = Dish.find(params[:dish_id])
    @review = @dish.reviews.create(review_params)